src/InformationRegisters/дкл_Полки/дкл_Полки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_Полки</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дкл_СостоянияПолок</types>
    </type>
  </resources>
  <resources>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ярус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>depth</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Editable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>trayNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45fc64e2-aecd-481a-bcbe-307fcba05f97">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>дкл_КоординатаХНижнегоКрая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>дкл_КоординатаУНижнегоКрая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>дкл_Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>дкл_Глубина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/дкл_Полки/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//@skip-check using-isinrole
	Если НЕ РольДоступна(Метаданные.Роли.дкл_Администратор) 
	  И НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РеквизитыПолки = Новый Структура("trayNumber, title, barcode");
	ЗаполнитьЗначенияСвойств(РеквизитыПолки, ТекущийОбъект);
	
	Попытка
		Ответ = дкл_ОбменДаннымиСервер.ОбновитьПолкуВЛифте(ТекущийОбъект.НастройкаСклада, РеквизитыПолки);
		Если ЗначениеЗаполнено(Ответ.errorCode) Тогда               
			Текст = НСтр("ru = '%1 (код ошибки %2)'");
			Текст = СтрШаблон(Текст, Ответ.message, Ответ.errorCode);
			ОбщегоНазначения.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
	Исключение
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),,,,Отказ);
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// отдельно изменение возможности редактирования полки

	РеквизитыПолки = Новый Структура("trayNumber, Editable");
	ЗаполнитьЗначенияСвойств(РеквизитыПолки, ТекущийОбъект);

	Попытка
		Ответ = дкл_ОбменДаннымиСервер.РедактированиеПолкиВЛифте(ТекущийОбъект.НастройкаСклада, РеквизитыПолки);
		// ОбщегоНазначения.СообщитьПользователю(Ответ.message);
	Исключение
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),,,,Отказ);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЯрусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ЯрусыСклада(Запись.НастройкаСклада));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЯрусыСклада(НастройкаСклада)
	
	ЗначенияРеквизитовОбъекта = 
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаСклада, "Стеллаж, Линия, Склад");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад"  , ЗначенияРеквизитовОбъекта.Склад);
	Запрос.УстановитьПараметр("Стеллаж", ЗначенияРеквизитовОбъекта.Стеллаж);
	Запрос.УстановитьПараметр("СтеллажНеУстановлен", НЕ ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.Стеллаж));
	Запрос.УстановитьПараметр("Линия"  , ЗначенияРеквизитовОбъекта.Линия);              
	Запрос.УстановитьПараметр("ЛинияНеУстановлена" , НЕ ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.Линия));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладскиеЯчейки.Ярус КАК Ярус
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	НЕ СкладскиеЯчейки.Ярус = """"     
	|	И СкладскиеЯчейки.Владелец = &Склад
	|	И (&ЛинияНеУстановлена  ИЛИ СкладскиеЯчейки.Линия   = &Линия)
	|	И (&СтеллажНеУстановлен ИЛИ СкладскиеЯчейки.Стеллаж = &Стеллаж)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ярус";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ярус");
	
КонецФункции

#КонецОбласти
